# 7.1 处理缺失值

In [1]:
# NaN

In [6]:
import pandas as pd
import numpy as np

In [7]:
from pandas import Series, DataFrame

In [8]:
string_data = pd.Series(['a', 'b', np.nan, 'c'])

In [9]:
string_data

0      a
1      b
2    NaN
3      c
dtype: object

In [10]:
# isnull 返回表明哪些值是缺失值的布尔值

In [12]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

## 7.1.1 过滤缺失值

In [13]:
# dropna 返回Series内所有的非空数据及其索引值：

In [14]:
from numpy import nan as NA

In [15]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [16]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [17]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [23]:
# 当处理DataFrame对象时， dropna 默认情况下会删除包含缺失值的行

In [19]:
data = pd.DataFrame([[1, 6.5, 3],[1, NA, NA],[NA, NA, NA],[NA, 6.5, 3]])

In [20]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
cleaned = data.dropna()

In [22]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [24]:
# 传入how='all'时，将删除所有值均为NA的行:

In [25]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [26]:
data[4]=NA

In [27]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [28]:
# 如果删除列，传入 axis = 1：

In [29]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

## 7.1.2 补全缺失值

In [30]:
# fillna

In [31]:
data.fillna(0)

     0    1    2    4
0  1.0  6.5  3.0  0.0
1  1.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  6.5  3.0  0.0

# 7.2 数据转换

## 7.2.1 删除重复值

In [34]:
data = pd.DataFrame({'k1': ['one','two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [35]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [37]:
# duplicated 返回布尔值Series，反映每一行是否与之前出现的行相同
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

## 7.2.2 使用函数进行数据转换

In [40]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5 , 8, 3, 5, 6]})

In [41]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [42]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [43]:
lowercased = data['food'].str.lower()

In [44]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [45]:
data['animal'] = lowercased.map(meat_to_animal)

In [46]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## 7.2.3 替代值

# 7.3 字符串操作